In [2]:
# 조건으로 검색하기

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
pd.DataFrame(np.random.rand(5,2), columns=['A','B'])

          A         B
0  0.902339  0.172580
1  0.501701  0.654618
2  0.288077  0.555229
3  0.202236  0.418491
4  0.873191  0.232444

In [4]:
df = pd.DataFrame(np.random.rand(5,2), columns=['A','B'])

print(df['A'])
print()
print(df['A']<0.5)
print()

print(df[(df['A']<0.5) & (df['B']>0.3)])
print()
print(df.query('A < 0.5 and B > 0.3'))

0    0.902086
1    0.532871
2    0.638597
3    0.855959
4    0.539451
Name: A, dtype: float64

0    False
1    False
2    False
3    False
4    False
Name: A, dtype: bool

Empty DataFrame
Columns: [A, B]
Index: []

Empty DataFrame
Columns: [A, B]
Index: []

In [5]:
print(df[(df['A']<0.5) & (df['B']>0.3)])
print()

condition = (df['A']<0.5) & (df['B']>0.3)
print(df[condition])

Empty DataFrame
Columns: [A, B]
Index: []

Empty DataFrame
Columns: [A, B]
Index: []

In [6]:
# 문자열 조건 검색

data = {
    'Animal' : ["Dog","Cat","Cat", "Pig","Cat"],
    'Name' : ["Happy","Sam","Tom","Mini","Rocky"]
}

print(data)

{'Animal': ['Dog', 'Cat', 'Cat', 'Pig', 'Cat'], 'Name': ['Happy', 'Sam', 'Tom', 'Mini', 'Rocky']}

In [7]:
pd.DataFrame(data)

  Animal   Name
0    Dog  Happy
1    Cat    Sam
2    Cat    Tom
3    Pig   Mini
4    Cat  Rocky

In [8]:
df = pd.DataFrame(data)
df.head(3)

  Animal   Name
0    Dog  Happy
1    Cat    Sam
2    Cat    Tom

In [9]:
df['Animal']

0    Dog
1    Cat
2    Cat
3    Pig
4    Cat
Name: Animal, dtype: object

In [10]:
df['Animal'].str.contains("Cat")
# str.contains() 문자 중에 검색하는 문자가 포함되어 있는지 확인 (T/F)

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [11]:
df.Animal.str.match("Cat")

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [12]:
df[df['Animal'].str.contains("Cat")]

  Animal   Name
1    Cat    Sam
2    Cat    Tom
4    Cat  Rocky

In [13]:
# 도와줘요

#문자열 검색할 때 contain하고 match 둘다 대소문자에 따라 결과값이  
#다르게 나오는 것 같은데 대소문자 상관없이 나오게 할 수 있는 방법도 있나요?

# Yes. case 옵션 사용, case=False 사용하세요

In [14]:
df

  Animal   Name
0    Dog  Happy
1    Cat    Sam
2    Cat    Tom
3    Pig   Mini
4    Cat  Rocky

In [15]:
df['Animal']

0    Dog
1    Cat
2    Cat
3    Pig
4    Cat
Name: Animal, dtype: object

In [16]:
df['Animal'].str.contains("Cat")

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [17]:
df['Animal'].str.contains("cat", case=False)

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [18]:
df['Animal'].str.match("cat")

0    False
1    False
2    False
3    False
4    False
Name: Animal, dtype: bool

In [19]:
df['Animal'].str.match("cat", case=False)

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [20]:
# 함수로 데이터 처리하기

pd.DataFrame(np.arange(5), columns= ['num'])

   num
0    0
1    1
2    2
3    3
4    4

In [21]:
# apply() : 함수를 받아 적용함

df = pd.DataFrame(np.arange(5), columns= ['num'])

def square(x):
    return x**2

print(df)
print()
print(df['num'])

print()
print(df['num'].apply(square))

   num
0    0
1    1
2    2
3    3
4    4

0    0
1    1
2    2
3    3
4    4
Name: num, dtype: int32

0     0
1     1
2     4
3     9
4    16
Name: num, dtype: int64

In [22]:
# 새 열 생성 >> 기존 데이터 프레임에 삽입
df['square'] = df['num'].apply(square)

df

   num  square
0    0       0
1    1       1
2    2       4
3    3       9
4    4      16

In [23]:
df.num

0    0
1    1
2    2
3    3
4    4
Name: num, dtype: int32

In [24]:
df.num.apply(lambda x : x **2)

0     0
1     1
2     4
3     9
4    16
Name: num, dtype: int64

In [25]:
df['square_lambda'] = df.num.apply(lambda x : x **2)

print(df)

   num  square  square_lambda
0    0       0              0
1    1       1              1
2    2       4              4
3    3       9              9
4    4      16             16

In [26]:
# 함수로 데이터 처리하기

df = pd.DataFrame(columns=['phone'])

df.loc[0] = "010-1234-5678"
df.loc[1] = "공일공-일이삼사-오육칠팔"
df.loc[2] = "010.1234.5678"
df.loc[3] = "공1공-1234-5육7팔"
df['preprocess_phone'] = ''

In [27]:
df

           phone preprocess_phone
0  010-1234-5678
1  공일공-일이삼사-오육칠팔
2  010.1234.5678
3  공1공-1234-5육7팔

In [28]:
def 전처리(phone):
    mapping = {
        "공": "0",
        "일" : "1",
        "이" : "2",
        "삼" : "3",
        "사" : "4",
        "오" : "5",
        "육" : "6",
        "칠" : "7",
        "팔" : "8",
        "-" : "",
        "." : ""
    }
    
    for key , value in mapping.items():
        phone = phone.replace(key,value)
    return phone

In [29]:
df['phone']

0    010-1234-5678
1    공일공-일이삼사-오육칠팔
2    010.1234.5678
3    공1공-1234-5육7팔
Name: phone, dtype: object

In [30]:
df['phone'].apply(전처리)

0    01012345678
1    01012345678
2    01012345678
3    01012345678
Name: phone, dtype: object

In [31]:
df['preprocess_phone'] = df['phone'].apply(전처리)


df

           phone preprocess_phone
0  010-1234-5678      01012345678
1  공일공-일이삼사-오육칠팔      01012345678
2  010.1234.5678      01012345678
3  공1공-1234-5육7팔      01012345678

In [32]:
# replace : apply 기능에서 데이터 값만 대체하고 싶을 때 사용

data = {"0":"Male", "1":"Male","2":"Female","3":"Female","4":"Male"}
data

{'0': 'Male', '1': 'Male', '2': 'Female', '3': 'Female', '4': 'Male'}

In [33]:
data.values()

dict_values(['Male', 'Male', 'Female', 'Female', 'Male'])

In [34]:
list(data.values())

['Male', 'Male', 'Female', 'Female', 'Male']

In [35]:
data_list = list(data.values())

In [36]:
pd.DataFrame(data_list, columns = ['Sex'])

      Sex
0    Male
1    Male
2  Female
3  Female
4    Male

In [37]:
df = pd.DataFrame(data_list, columns = ['Sex'])

df.Sex.replace({"Male":0, "Female":1})
# 라벨 인코딩 (0,1 인코딩)

0    0
1    0
2    1
3    1
4    0
Name: Sex, dtype: int64

In [38]:
df.Sex.replace({"Male":0, "Female":1}, inplace=True)

In [39]:
df

   Sex
0    0
1    0
2    1
3    1
4    0

In [40]:
# 그룹으로 묶기
# 조건부로 집계하고 싶은 경우

pd.DataFrame({'key': ['A','B','C','A','B','C'],
              'data' : range(6)})

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [41]:
df = pd.DataFrame({'key': ['A','B','C','A','B','C'],
              'data' : range(6)})

df.head()

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4

In [42]:
df.groupby('key')

In [43]:
df.groupby('key').sum()
# 'key' 별로 묶어서 각 key별로 더해줘

     data
key
A       3
B       5
C       7

In [44]:
df.groupby(['key','data']).sum()
# 'key', 'data' 로 각각 합쳐서 보여줘

Empty DataFrame
Columns: []
Index: [(A, 0), (A, 3), (B, 1), (B, 4), (C, 2), (C, 5)]

In [45]:
# aggregate 
# groupby  통해서 집계를 한번에 계산하고자 할 때


# 데이터 생성
data = {
    'group' : ['A','B','A','B','A','B','A','B'],
    'data1' :[20,30,40,20,30,40,30,50],
    'data2' : [1,2,3,4,5,6,7,8]
    
}

pd.DataFrame(data)

  group  data1  data2
0     A     20      1
1     B     30      2
2     A     40      3
3     B     20      4
4     A     30      5
5     B     40      6
6     A     30      7
7     B     50      8

In [46]:
df = pd.DataFrame(data)

df.head()

  group  data1  data2
0     A     20      1
1     B     30      2
2     A     40      3
3     B     20      4
4     A     30      5

In [47]:
df.groupby('group').aggregate(['min', 'median', 'max'])

      data1            data2
        min median max   min median max
group
A        20   30.0  40     1    4.0   7
B        20   35.0  50     2    5.0   8

In [48]:
df.groupby('group').aggregate({'data1':'min', 'data2':'sum'})

       data1  data2
group
A         20     16
B         20     20

In [51]:
# filter
# group by 통해 그룹으로 묶은 상태에서 그룹 속성을 기준으로 데이터를 필터링 함

def filter_mean(x):
    return x['data2'].mean() > 3

print(df.groupby('group').mean())

       data1  data2
group
A       30.0    4.0
B       35.0    5.0

In [52]:
print(df.groupby('group').filter(filter_mean))

  group  data1  data2
0     A     20      1
1     B     30      2
2     A     40      3
3     B     20      4
4     A     30      5
5     B     40      6
6     A     30      7
7     B     50      8

In [53]:
# apply 
# groupby를 통해 묶인 데이터에 함수 적용

df.groupby('group').apply(lambda x : x.max() - x.min())

       data1  data2
group
A         20      6
B         30      6

In [54]:
# get_group
# groupby로 묶인 데이터에서 key 값으로 데이터 가져오기


df.groupby('group').get_group('A')

  group  data1  data2
0     A     20      1
2     A     40      3
4     A     30      5
6     A     30      7

In [56]:
# Multi index
# index 를 계층으로 구성함

pd.DataFrame(
    np.random.randn(4,2),
    index = [['A','A','B','B'], [1,2,1,2]],
    columns = ['data1','data2']
)

        data1     data2
A 1 -0.885007 -0.206314
  2 -2.220862 -1.643690
B 1  0.451119 -0.372646
  2  1.431396  0.240366

In [59]:
df = pd.DataFrame(
    np.random.randn(4,2),
    index = [['A','A','B','B'], [1,2,1,2]],
    columns = ['data1','data2']
)

df['data1']

A  1   -0.846583
   2   -0.130154
B  1   -0.325861
   2   -0.914731
Name: data1, dtype: float64

In [63]:
df_col = pd.DataFrame(
    np.random.randn(4,4),
    columns=[['A','A','B','B'], ['1','2','1','2']]
)

df_col

          A                   B
          1         2         1         2
0 -0.790747  2.763332 -1.179703 -1.244713
1  0.804931  0.171073  1.210776 -1.436153
2 -0.140487  0.020755 -0.425149 -0.001853
3  1.027807 -1.012062  0.990575 -0.527811

In [65]:
df_col['A']

          1         2
0 -0.790747  2.763332
1  0.804931  0.171073
2 -0.140487  0.020755
3  1.027807 -1.012062

In [66]:
df_col['A']['1']

0   -0.790747
1    0.804931
2   -0.140487
3    1.027807
Name: 1, dtype: float64

In [67]:
# pivot_table
# index : 행 index로 들어갈 key 
# column :  열 index로 라벨링이 되는 값
# value : 분석할 데이터 값

df

        data1     data2
A 1 -0.846583 -0.319007
  2 -0.130154 -1.253180
B 1 -0.325861 -0.070269
  2 -0.914731  0.360997

In [82]:
data = {
    "날짜": ["2020-01-01", "2020-01-01", "2020-01-01", "2020-01-02", "2020-01-02", "2020-01-02"],
    "카테고리": ["과일", "채소", "채소", "과일", "과일", "채소"],
    "수량": [10, 15, 5, 20, 10, 5],
    "판매처" : ["서울","부산","제주","서울","부산","제주"]
}

In [83]:
pd.DataFrame(data)

           날짜 카테고리  수량 판매처
0  2020-01-01   과일  10  서울
1  2020-01-01   채소  15  부산
2  2020-01-01   채소   5  제주
3  2020-01-02   과일  20  서울
4  2020-01-02   과일  10  부산
5  2020-01-02   채소   5  제주

In [84]:
df = pd.DataFrame(data)

df.pivot_table(
    index = '날짜',
    columns = '카테고리',
    values = '수량',
    aggfunc = 'sum'
)

카테고리        과일  채소
날짜
2020-01-01  10  20
2020-01-02  30   5

In [85]:
df.pivot_table(
    index = '날짜',
    columns = '카테고리',
    values = '수량',
    aggfunc = 'mean'
)

카테고리          과일    채소
날짜
2020-01-01  10.0  10.0
2020-01-02  15.0   5.0

In [92]:
df.pivot_table(
    index = '날짜',
    columns = ['카테고리','판매처'],
    values = '수량',
    aggfunc = 'mean',
    fill_value=0
)

카테고리          과일          채소
판매처           부산    서울    부산   제주
날짜
2020-01-01   0.0  10.0  15.0  5.0
2020-01-02  10.0  20.0   0.0  5.0